"""
Да се реализира на python програма за създаване на хистограма на честотата на срещане на
символите в даден текст. Програмата да приема като входни параметър текст и да извежда в конзолата съдържанието на речник, съдържащ ключове - символите от текста, 
а стойностите  - броя срещания на съответния символ. Името на изпълнимия файл да е в следния формат: FXXXXX_L4_T2.py, където FXXXXX е вашият факултетен номер. 

Примерен изход:

text="brontosaurus"
print h
{'a': 1, 'b': 1, 'o': 2, 'n': 1, 's': 2, 'r': 2, 'u': 2, 't': 1}
  
"""
import sys

text = sys.argv[1]
histogram = {}

for i in range (0, len(text)) :
    histogram.setdefault(text[i].lower(), 0)
    histogram[text[i].lower()] += 1
        
print(histogram)